editted the wREADME.md file documented the whole thought process and how i ended up taking the decison documented all the features and tradeoffs explained all the features with a detailed architecture and flow diagram trade off tables and iterative reasoning for specific architecture
